api/app/Http/Controllers/Backend/RoleController.php

select `key`, `title` from `role` where (`key` <> 'super_admin') order by `created_at` asc
select `key` from `role` where `full_access` = 1
---
    public function index(Request $request)
    {
        $result = Role::select('key', 'title')
            ->where(function ($q) {
                if (Auth::check()) {
                  if (Auth::user()->role_key != 'programmer') {

                      if (! in_array(Auth::user()->role_key, Role::where('full_access', 1)->pluck('key')->toArray())) {
                          $q->whereNotIn('key', Role::where('full_access', 1)->pluck('key')->toArray());
                      }
                      if (Auth::user()->role_key != 'super_admin') {
                          $q->where('key', '<>', 'super_admin');
                      }
                      $q->where('key', '<>', 'programmer');
                  }
                }
            })
            ->orderBy('created_at','asc')
            ->get();