api/app/Http/Controllers/Backend/UserController.php

select `key` from `role` where `full_access` = 1
---
    public function index(Request $request)
    {

        $entities = User::select(['id','name', 'mobile', 'created_at', 'role_key', 'status'])->with(['role' => function($q) {
            $q->select('key', 'title');
        }])->where(function ($q) use($request) {
            if ($request->has('search')) {
                $filter = json_decode($request->get('search'), true);
                if (@$filter['name']) {
                    $q->where('name', 'like', '%' . $filter['name'] . '%');
                }

                if (@$filter['mobile']) {
                    $q->where('mobile', 'like', '%' . $filter['mobile'] . '%');
                }

                if (@$filter['email']) {
                    $q->where('email', 'like', '%' . $filter['email'] . '%');
                }

                if (@$filter['role_key'] != -1) {
                    $q->where('role_key', $filter['role_key']);
                } else {
                    if (Auth::user()->role_key != 'programmer') {

                        if (! in_array(Auth::user()->role_key, Role::where('full_access', 1)->pluck('key')->toArray())) {

select `id`, `name`, `mobile`, `created_at`, `role_key`, `status` from `users` where `id` = '1' limit 1
select `key`, `title` from `role` where `role`.`key` in (0)
---
    public function show($id) {
        $entities = User::select(['id', 'name', 'mobile', 'created_at', 'role_key', 'status'])->with(['role' => function($q) {
            $q->select('key', 'title');
        }])->where('id', $id)->first();