api/app/Http/Controllers/Auth/LoginController.php

    public function login(Request $request)
    {

        $validator = \Validator::make($request->all(), [
            'username' => 'required',
            'password' => 'required',
            'domain' => 'required'
        ]);

        if ( $validator->fails() ) {
            return Response()->json(['status' => false, 'message' => $validator->errors()->first()]);
        }

        // first time check domain active
        $domain = Domain::select('android', 'ios', 'maintenance_mode', 'register', 'basket', 'user_dashboard', 'admin_panel')->where('key', $request->get('domain'))->where('status', 1)->first();
---
select `android`, `ios`, `maintenance_mode`, `register`, `basket`, `user_dashboard`, `admin_panel` from `domain` where `key` = 'localhost:3000' and `status` = 1 limit 1


        $user = $request->user();

        if (! in_array($user->role_key, Role::where('full_access', 1)->pluck('key')->toArray()) ) {
---
select `key` from `role` where `full_access` = 1