api/routes/api.php

select * from `social_media`
---

    Route::group(['prefix' => 'socialMedias'], function () {
        Route::get('/', function () {
            $response = \App\SocialMedia::all();

select * from `communication_channel`
---
    Route::group(['prefix' => 'communicationChannels'], function () {

        Route::get('/', function () {
            $response = \App\CommunicationChannel::all();